app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-04-11 21:34:49.566083"], ["id", 1]]
---
  def update
    set_student
    @student.update(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", nil]]
---
  def set_student
    @student = Student.find(params.require(:id))